HW7_Remake/app/controllers/api/v1/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    authors = Author.all

INSERT INTO "authors" ("name", "lastname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Edited post"], ["lastname", "I was edit this post!"], ["email", "testuser"], ["created_at", "2022-11-28 12:04:35.305097"], ["updated_at", "2022-11-28 12:04:35.305097"]]
---
  def create
    author = Author.new(author_params)

    if author.save