HW7_Remake/app/controllers/api/v1/comments_controller.rb

  def index
    comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def show
    comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    comment = Comment.new(comment_params)

    if comment.save
---
INSERT INTO "comments" ("body", "status", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Second test for status"], ["status", 0], ["author_id", 1], ["post_id", 1], ["created_at", "2022-11-27 19:46:49.284371"], ["updated_at", "2022-11-27 19:46:49.284371"]]

  def update
    comment = Comment.find(params[:id])

    if comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "author_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["author_id", 2], ["updated_at", "2022-11-27 20:00:37.953455"], ["id", 2]]