HW7_Remake/app/controllers/api/v1/likes_controller.rb

SELECT "likes".* FROM "likes"
---
  def index
    likes = Like.all

INSERT INTO "likes" ("author_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2022-12-12 17:02:19.680751"], ["updated_at", "2022-12-12 17:02:19.680751"]]
---
  def create
    like = Like.new(like_params)

    if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]
---
  def destroy
    like = Like.find(params[:id])

    if like.destroy