HW7_Remake/app/controllers/api/v1/posts_controller.rb

  def index
    posts = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    post = Post.new(create_post_params)

    if post.save
---
INSERT INTO "posts" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Edited post"], ["body", "I was edit this post!"], ["author_id", 1], ["created_at", "2022-11-28 09:28:54.112978"], ["updated_at", "2022-11-28 09:28:54.112978"]]

  def update
    post = Post.find(params[:id])

    if post.update(update_post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Edited post"], ["body", "I was edit this post!"], ["updated_at", "2022-11-27 20:26:53.559289"], ["id", 3]]

  def destroy
    post = Post.find(params[:id])

    if post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]