array = [621, 445, 147, 159, 430, 222, 482, 44, 194, 522, 652, 494, 14, 126, 532, 387, 441, 471, 337, 446, 18, 36, 202, 574, 556, 458, 16, 139, 222, 220, 107, 82, 264, 366, 501, 319, 314, 430, 55, 336]
#Дізнатися кількість елементів в масиві
puts array.length.to_s
#Перевернути масив
puts array.reverse.to_s
#Знайти найбільше число
puts array.max.to_s
#Знайти найменше число
puts array.min.to_s
#Відсортувати від меншого до більшого
puts array.sort.to_s
#Відсортувати від більшого до меншого
puts array.sort.reverse.to_s
#Видалити всі непарні числа
puts array.select { |e| e.even? }.to_s
#Залишити тільки ті числа, які без остачі діляться на 3
puts array.select { |e| e % 3 == 0 }.to_s
#Видалити з масиву числа, які повторюються
puts array.uniq.to_s