HW7/app/serializers/api/v1/post_serializer/comment_serializer.rb

  def author
    author = Author.find(object.author_id)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]