HW10/app/views/products/index.html.erb

            <li><a href="products" class="link-dark d-inline-flex text-decoration-none rounded" style="color: white; margin-bottom: 15px">All</a></li>
            <% categories = Category.all %>
---
SELECT "categories".* FROM "categories"