HW10/app/views/products/show.html.erb

          </li>
          <% Category.all.each do |cat| %>
---
SELECT "categories".* FROM "categories"