HW7/app/serializers/api/v1/post_serializer.rb

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def author
    author = Author.find(object.author_id)