HW7/app/controllers/api/v1/authors_controller.rb

  def index
    authors = Author.all
---
SELECT "authors".* FROM "authors"

  def show
    author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    author = Author.new(author_params)

    if author.save
---
INSERT INTO "authors" ("name", "lastname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Edited post"], ["lastname", "I was edit this post!"], ["email", "testuser"], ["created_at", "2022-11-28 12:04:35.305097"], ["updated_at", "2022-11-28 12:04:35.305097"]]