HW7/app/controllers/api/v1/comments_controller.rb

  def index
    comments = Comment.all
    if params[:status] then comments = comments.where(status: params[:status]) end
---
SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."status" = $1  [["status", 1]]

  def show
    comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    comment = Comment.new(comment_params)

    if comment.save
---
INSERT INTO "comments" ("body", "status", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Testing before_action"], ["status", 0], ["author_id", 1], ["post_id", 1], ["created_at", "2022-12-14 20:09:28.614386"], ["updated_at", "2022-12-14 20:09:28.614386"]]

  def update
    comment = Comment.find(params[:id])

    if comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "status" = $2, "author_id" = $3, "post_id" = $4, "updated_at" = $5 WHERE "comments"."id" = $6  [["body", "string"], ["status", 1], ["author_id", 1], ["post_id", 2], ["updated_at", "2022-12-21 09:29:27.328391"], ["id", 1]]

  def destroy
    comment = Comment.find(params[:id])

    if comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]