HW7/app/controllers/api/v1/findpost_controller.rb

  def index
    keywords = params[:keywords].to_s
    result = Post.where("title ILIKE ? OR body ILIKE ?", "%#{keywords}%", "%#{keywords}%")
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%Post%' OR article LIKE '%Post%')