HW7/app/controllers/api/v1/posts_controller.rb

  def index
    posts = Post.all
    #http://127.0.0.1:3000/api/v1/posts?search=keywords
    if params[:search] then posts = posts.find_post(params[:search]) end
    #http://127.0.0.1:3000/api/v1/posts?status=unpublished/published
    if params[:status] then posts = posts.filter_by_status(params[:status]) end
    #http://127.0.0.1:3000/api/v1/posts?author_id=1
    if params[:author_id] then posts = posts.filter_by_author(params[:author_id]) end
    #http://127.0.0.1:3000/api/v1/posts?tags=tag1,tag2,tag3
    if params[:tags]
      filtered_ids = []
      tags_array = params[:tags].split(',')
      post_ids = posts.all.ids
      coincidence = 1
      post_ids.each do |post_id|
        post = posts.find(post_id)
        tags_ids = post.tags.ids
        tags_array.each do |tag|
          coincidence = 0
          tags_ids.each do |tag_id|
            post_tag = Tag.find(tag_id)
            if post_tag.name.downcase == tag.downcase
              coincidence = 1
            end
          end
          if coincidence == 0 then break end
        end
        if coincidence == 1 then filtered_ids.push(post.id) end
      end
      unless filtered_ids.empty? then posts = posts.where(id: filtered_ids)
---
SELECT "posts".* FROM "posts" ORDER BY title
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "author_id" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "string222"], ["body", "string222"], ["author_id", 2], ["updated_at", "2022-12-20 15:04:10.520827"], ["id", 30]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."status" = $1 AND "posts"."author_id" = $2  [["status", 1], ["author_id", 1]]

  def create
    post = Post.new(post_params)

    if post.save
---
INSERT INTO "posts" ("title", "body", "author_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "string"], ["body", "string"], ["author_id", 1], ["status", 0], ["created_at", "2022-12-20 10:56:26.461955"], ["updated_at", "2022-12-20 10:56:26.461955"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "body" = $2, "author_id" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "string222"], ["body", "string222"], ["author_id", 2], ["updated_at", "2022-12-20 15:04:10.520827"], ["id", 30]]

  def destroy
    if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]