HW7/app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("title", "body", "author_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "string"], ["body", "string"], ["author_id", 1], ["status", 0], ["created_at", "2022-12-20 10:56:26.461955"], ["updated_at", "2022-12-20 10:56:26.461955"]]
---
  def create
    post = Post.new(post_params)

    if post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 31]]
---
  def destroy
    if @post.destroy