HW7/app/controllers/api/v1/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    tags = Tag.all

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    tag = Tag.find(params[:id])

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2022-12-12 14:42:42.042246"], ["updated_at", "2022-12-12 14:42:42.042246"]]
---
  def create
    tag = Tag.new(tag_params)

    if tag.save

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["name", "Edited tag"], ["updated_at", "2022-12-12 14:43:14.498535"], ["id", 3]]
---
  def update
    tag = Tag.find(params[:id])

    if tag.update(tag_params)

SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = $1  [["id", 3]]
---
  def destroy
    tag = Tag.find(params[:id])

    if tag.destroy